
import iconpng from "../ficons/ficon.png";
import user1 from "../ficons/user1.png";
import user2 from "../ficons/user2.png";
import user3 from "../ficons/user3.png";
import user4 from "../ficons/user4.png";
import user5 from "../ficons/user5.png";
import user6 from "../ficons/user6.png";
import user7 from "../ficons/c.png";
import c1 from "../ficons/c1.jpg";
import c2 from "../ficons/c2.jpg";
import c3 from "../ficons/c3.jpg";
import c4 from "../ficons/c4.jpg";
import c5 from "../ficons/c5.jpg";
import c6 from "../ficons/c6.jpg";
import w1 from "../ficons/web1.jpg";
import w2 from "../ficons/w2.jpg";
import w3 from "../ficons/web3.jpg";
import w4 from "../ficons/web4.jpg";
import w5 from "../ficons/web5.jpg";
import w6 from "../ficons/web6.jpg";
import game1 from "../ficons/game1.jpg";
import game2 from "../ficons/game2.jpg";
import game3 from "../ficons/game3.jpg";
import game4 from "../ficons/game4.jpg";
import com1 from "../ficons/voip1.jpg";
import com2 from "../ficons/voip2.jpg";

export const navItems = [
  { label: "الرئيسيه", href: "/" },
  { label: "خدمات المواقع", href: "/Web" },
  { label: "تطوير البرمجيات", href: "/Software" },
  { label: "تطوير الالعاب", href: "/GamesDev" },
  { label: "خدمات الاتصالات", href: "/Communication" },
  { label: "الدعاية والاعلان", href: "/Advertisement" },
];

export const features = [
  {
    image: user1,
    fname: "إستضافة المواقع",
    description:
      "نقوم بتوفير خدمة استضافة المواقع باعلى التقنيات  تتيح للأفراد والشركات نشر مواقعهم الإلكترونية على الإنترنت",
  },  
  {
    image: user5,
    fname: "البريد الالكتروني",
    description:
      "نوفر لك خدمة مميزة وهي  خدمة تسمح للأفراد والشركات بإنشاء وإدارة حسابات البريد الإلكتروني باستخدام نطاقاتهم",
  },  
  {
    image: user4,
    fname: "تصميم المواقع",
    description:
      "نقوم بالابتكار توظيف تقنيات حديثة لضمان جاذبية الموقع وسهولة التصفح، مما يعزز الهوية الرقمية ",
  },  
  {
    image: user2,
    fname: "برمجيات المواقع",
    description:
      " تطوير تطبيقات ومواقع إلكترونية باستخدام لغات برمجة ، مما يضمن تفاعل مع المحتوى بشكل ديناميكي وفعال",
  },  
  {
    image: user6,
    fname: "استراتيجات العمل",
    description:
      "تتضمن وضع خطة شاملة لتعزيز الظهور الرقمي وجذب الزوار، من خلال استخدام تقنيات مثل تحسين محركات البحث",
  },  
  {
    image: user3,
    fname: "الخدمات الامنية",
    description:
      " تشمل مجموعة من التدابير والتقنيات لحماية المواقع من التهديدات السيبرانية، مثل الهجمات الإلكترونية ",
  },  


];
export const Customers = [
  {
    image: c1,
    fname: "فيدا ورك ستيشن",
  
  },  
  {
    image: c2,
    fname: "شركة عفارم",

  },  
  {
    image: c3,
    fname: "مطاعم الثورة",

  },  
  {
    image: c4,
    fname: "مطاعم لهاليبو",

  },  
  {
    image: c5,
    fname: "مطاعم توما",

  },  
  {
    image: c6,
    fname: "شركة انترفود",

  },  


];
export const checklistItems = [
  {
    title: "واجهة مستخدم سهلة",
    description:
      "تصميم بسيط وسهل الاستخدام يساعد الزبائن في التنقل والبحث عن المنتجات بسهولة",
  },
  {
    title: "إدارة المنتجات",
    description:
      " إمكانية إضافة وتحرير وحذف المنتجات بسهولة، مع إمكانية تنظيمها في فئات مختلفة",
  },
  {
    title: "نظام الدفع المتكامل",
    description:
      " دعم لعدة طرق دفع مثل بطاقات الائتمان، باي بال، وغيرها، مما يسهل على الزبائن إجراء عمليات الشراء",
  },
  {
    title: "إدارة الطلبات",
    description:
      "إمكانية متابعة حالة الطلبات وإدارتها بفعالية، مما يساعد في تحسين تجربة العميل",
  },
  {
    title: "دعم التسويقSEO ",
    description:
      "ميزات لتحسين محركات البحث (SEO) ودمج أدوات التسويق لتعزيز الظهور وزيادة المبيعات",
  },
  {
    title: "أمان البيانات",
    description:
      "تدابير أمان متقدمة لحماية بيانات العملاء والمعاملات المالية تضمن لك اعلى نسبة امان للبيانات",
  },
];
export const pricingOptions = [
  {
    title: "المواقع الشخصية",
    price: "$100",
    features: [
      "مساحة : ٥ جيجا بايت",
      "نقل البيانات : ٥٠ جيجا شهريا",
      "حسابات البريد : ٥ حسابات",
      "نطاق خاص .com / .net / .org",
    ],
  },
  {
    title: "المتجر الالكتروني",
    price: "$250",
    features: [
      "مساحة : ٥٠ جيجا بايت",
      "نقل البيانات : ٢٠٠ جيجا شهريا",
      "نسخة المتجر + تصميم خاص",
      "حسابات البريد : ٢٠ حساب",
      "نطاق خاص .com / .net / .org",
    ],
  },
  {
    title: "مواقع الشركات ",
    price: "$300",
    features: [
      "مساحة : ٥٠ جيجا بايت",
      "نقل البيانات : ٢٠٠ جيجا شهريا",
      "تصميم الموقع بالكامل ",
      "حسابات البريد : ٣٠ حساب",
      "نطاق خاص .com / .net / .org",
    ],
  },
];
export const testimonials = [
  { image: user7,
    user: "Dr. Motaz Orebey",
    company: "VidaWorkStation",
   
    text: "أنا راضٍ جدًا عن الخدمات المقدمة. كان الفريق سريع الاستجابة ومحترفًا وحقق نتائج تفوق توقعاتي",
  },
  {
    user: "Moustafa Mohamed",
    company: "GameZad",
    image: user7,
    text: "لا أستطيع أن أكون أكثر سعادة بنتيجة مشروعنا  وكان لمهارات الإبداع وحل المشكلات التي يتمتع بها الفريق دور فعال في ذلك",
  },
  {
    user: "Ahmed Shalaby",
    company: "KotoGames",
    image: user7,
    text: "العمل مع هذه الشركة كان من دواعي سروري. إن اهتمامهم بالتفاصيل والتزامهم بالتميز أمر يستحق الثناء. سأكون في غاية يوصي بها لأي شخص يبحث عن خدمة من الدرجة الأولى",
  },
  {
    user: "Rana Mohamed",
    company: "Fusion Dynamics",
    image: user7,
    text: "كان العمل مع الفريق بمثابة تغيير جذري في مشروعنا. لقد ساعدنا اهتمامهم بالتفاصيل والحلول المبتكرة على تحقيق أهدافنا بشكل أسرع مما كنا نعتقد أنه ممكن. ونحن ممتنون لخبرتهم واحترافهم",
  },
  {
    user: "Walid Ehab",
    company: "Visionary Creations",
    image: user7,
    text: "أنا مندهش من مستوى الاحتراف والتفاني الذي أظهره الفريق. لقد كانوا قادرين على تجاوز توقعاتنا وتحقيق نتائج رائعة",
  },
  {
    user: "Eman Fayed",
    company: "Synergy Systems",
    image: user7,
    text: "لقد بذل الفريق قصارى جهده لضمان نجاح مشروعنا. خبرتهم وتفانيهم لا مثيل لها. وإنني أتطلع إلى العمل معهم مرة أخرى في المستقبل",
  },
];



export const resourcesLinks = [
  { href: "/Web", text: "إستضافة المواقع" },
  { href: "/Web", text: "البريد الالكتروني" },
  { href: "/Web", text: "تصميم المواقع" },
  { href: "/Web", text: "برمجيات المواقع" },
  { href: "/Web", text: "الخدمات الامنية" },
];

export const platformLinks = [
  { href: "/Software", text: "برمجيات الادارة" },
  { href: "/Communication", text: "خدمات الاتصالات" },
  { href: "/GamesDev", text: "برمجة الالعاب" },
  { href: "/Web", text: "الحلول الامنية" },
  { href: "/Adv", text: "الدعاية والاعلان" },
];


export const Webpage = [
  {
    title:"إستضافة المواقع",
    image: w1,
    fname: "الأداء العالي والسرعة",
    fname2: "الأمان والحماية",
    description:
" تقدم خدمات استضافة المواقع الخوادم السريعة والمهيأة بشكل جيد، مما يضمن تحميل الصفحات بشكل سريع وتحسين تجربة المستخدم. هذا يساهم في تقليل معدل الارتداد وزيادة التفاعل مع المحتوى",     
 description2:
 "توفر العديد من خدمات الاستضافة ميزات أمان متقدمة مثل تشفير SSL، والحماية من هجمات DDoS، والنسخ الاحتياطي التلقائي. هذه الميزات تساعد على حماية بيانات الموقع وضمان استمرارية الخدمة",
      fname3: "الدعم الفني المتاح على مدار الساعة",
      description3:
       "توفر خدمات الاستضافة عادةً دعمًا فنيًا مستمرًا عبر الدردشة المباشرة أو الهاتف أو البريد الإلكتروني. هذا يضمن حصول المستخدمين على المساعدة عند الحاجة، مما يساهم في حل المشكلات بسرعة وكفاءة",
    },  
  {
    title:"البريد الالكتروني",
    image: w2,
    fname: "موثوقية وأمان متقدم",
    fname2: "إدارة مرنة وسهلة",
    description:
" تقدم خدمات استضافة البريد الإلكتروني حماية قوية من الفيروسات والبرامج الضارة، بالإضافة إلى تشفير البيانات أثناء النقل. هذا يضمن أن رسائل البريد الإلكتروني تبقى آمنة ومحفوظة بعيدًا عن التهديدات",     
 description2:
 " توفر هذه الخدمات واجهات سهلة الاستخدام تتيح للمستخدمين إدارة حساباتهم بكل يسر، بما في ذلك إعدادات البريد، وإنشاء حسابات جديدة، وإدارة القوائم البريدية. كما تدعم خدمات استضافة البريد الإلكتروني التكامل مع التطبيقات الأخرى مثل تقاويم العمل والتخزين السحابي",
      fname3: "دعم فني متواصل",
      description3:
       " توفر هذه الخدمات واجهات سهلة الاستخدام تتيح للمستخدمين إدارة حساباتهم بكل يسر، بما في ذلك إعدادات البريد، وإنشاء حسابات جديدة، وإدارة القوائم البريدية. كما تدعم خدمات استضافة البريد الإلكتروني التكامل مع التطبيقات الأخرى مثل تقاويم العمل والتخزين السحابي",
   
  },  
  {
    title:"تصميم المواقع",
    image: w3,
    fname: "تصميم مخصص وجذاب",
    fname2: "توافق مع الأجهزة المختلفة",
    description:
" توفر خدمات تصميم المواقع تصاميم فريدة تتناسب مع هوية العلامة التجارية، مما يساعد على جذب الزوار وتعزيز انطباعهم الأول. تصميمات احترافية تعكس رؤية وأهداف الشركة",     
 description2:
 "  تضمن خدمات التصميم إنشاء مواقع متجاوبة تعمل بشكل ممتاز على جميع الأجهزة، سواء كانت هواتف ذكية أو أجهزة لوحية أو حواسيب مكتبية. هذا يعزز تجربة المستخدم ويزيد من الوصول إلى جمهور أوسع",
      fname3: "تحسين تجربة المستخدم",
      description3:
       " يتم التركيز على تصميم واجهات مستخدم سهلة الاستخدام وفعالة، مما يسهل على الزوار التنقل في الموقع والعثور على المعلومات بسهولة. تجربة مستخدم إيجابية تؤدي إلى زيادة التفاعل والمبيعات",
   
  },  
  {
    title:"برمجيات المواقع",
    image: w4,
    fname: "تخصيص عالي ومرونة",
    fname2: "أداء محسن",
    description:
" توفر برمجيات المواقع إمكانية تخصيص متقدمة لتلبية احتياجات العملاء الخاصة، مما يتيح إنشاء ميزات ووظائف فريدة تعزز من تجربة المستخدم وتحقق أهداف العمل",     
 description2:
 "  تتمتع برمجيات المواقع بتصميمات مؤهلة لتحسين السرعة والأداء، مما يساهم في تحميل الصفحات بسرعة وتقليل وقت الانتظار. هذا يؤثر بشكل إيجابي على تجربة المستخدم ويعزز من تحسين محركات البحث",
      fname3: "تكامل مع أدوات وخدمات أخرى",
      description3:
       " تتيح برمجيات المواقع التكامل السلس مع منصات خارجية مثل نظم إدارة المحتوى (CMS)، وأدوات التحليل، ووسائل الدفع، مما يساعد على تحسين العمليات وزيادة الكفاءة",
   
  },  
  {   title:"استراتيجات العمل",
    image: w5,
    fname: "توجيه واضح للأهداف",

    fname2: "تحليل شامل للسوق",
    description:
" تساعد خدمات تكوين استراتيجية العمل على تحديد الأهداف والرؤى بشكل دقيق، مما يوفر خارطة طريق واضحة للشركة ويساعد في توجيه جميع الجهود نحو تحقيق النتائج المرجوة",     
 description2:
 "   تقدم هذه الخدمات تحليلاً عميقًا للسوق والمنافسين، مما يمكن الشركات من فهم الاتجاهات الحالية واحتياجات العملاء. هذا يساهم في اتخاذ قرارات مستنيرة وتحسين استراتيجيات التسويق",
      fname3: "مرونة في التكيف مع التغيرات",
      description3:
       "  تتيح استراتيجية العمل المدروسة إمكانية التكيف مع التغيرات في السوق أو الظروف الاقتصادية. هذا يضمن أن تظل الشركات قادرة على المنافسة والتطور، حتى في أوقات التحديات",
   
  },   
  {title:"الخدمات الامنية",
    image: w6,
    fname: "حماية شاملة ضد التهديدات",

    fname2: "تشفير البيانات",
    description:
" تشمل خدمات الأمان حماية فعالة من الفيروسات، والبرامج الضارة، وهجمات DDoS، مما يقلل من مخاطر الاختراق ويساهم في الحفاظ على سلامة البيانات والمعلومات الحساسة",     
 description2:
 " تضمن خدمات الأمان تشفير البيانات الحساسة، سواء أثناء النقل أو التخزين، مما يحمي المعلومات من الوصول غير المصرح به ويعزز ثقة العملاء في التعامل مع الموقع  ",
      fname3: "الاستجابة السريعة للحوادث",
      description3:
       "  توفر خدمات الأمان خطط استجابة سريعة للحوادث، مما يضمن التعامل الفوري مع أي تهديدات أو اختراقات قد تحدث. هذا يساعد على تقليل الأضرار المحتملة واستعادة العمليات بسرعة",
   
  },  


];
export const software1 = [
  {

    fname: "تطوير برمجيات مخصصة",
    description:
      "نقوم بتصميم وتطوير برمجيات حسابية تلبي احتياجاتك الخاصة، سواء كانت تطبيقات سطح المكتب أو تطبيقات الويب. نعمل معك لفهم متطلباتك ونوفر حلولاً مبتكرة تعزز من إنتاجيتك",
  },  
  {

    fname: "أنظمة إدارة متكاملة",
    description:
      "نقدم أنظمة إدارة شاملة تشمل إدارة المشاريع، وإدارة الموارد البشرية، وإدارة المخزون، وغيرها. تساعدك هذه الأنظمة في تنظيم أعمالك وتحسين تدفق العمل",
  },  
  {

    fname: "تحليل البيانات وتقارير شاملة",
    description:
      "نوفر أدوات لتحليل البيانات بشكل فعال، مما يمكّنك من اتخاذ قرارات مستنيرة. تتضمن خدماتنا إمكانية إنشاء تقارير مخصصة تساعدك في متابعة الأداء وتحقيق الأهداف ",
  },  
  {

    fname: "دعم فني متواصل",
    description:
      " فريقنا متاح على مدار الساعة لدعمك وحل أي مشاكل قد تواجهها. نؤمن بأهمية استمرارية عملك، لذا نحن هنا لنقدم لك المساعدة في أي وقت",
  },  
  

];
export const software2 = [
  {

    fname: "استشارة مبدئية",
    description:
      "نتحدث معك لفهم احتياجاتك وأهدافك",
  },  
  {

    fname: "تخطيط وتنفيذ",
    description:
      "نقوم بإعداد خطة تطوير شاملة ونبدأ في التنفيذ",
  },  
  {

    fname: "اختبار وضمان الجودة",
    description:
      " نختبر البرمجيات بدقة لضمان جودتها وأدائها ",
  },  
  {

    fname: "اختبار وضمان الجودة",
    description:
      " نختبر البرمجيات بدقة لضمان جودتها وأدائها ",
  }, 
  

];

export const gamedev = [
  {
    image: game1,
    fname: " تصميم الألعاب",
    description:
      "نقوم بتصميم ألعاب مبتكرة تناسب جميع الفئات العمرية، مع التركيز على تجربة المستخدم وتصميم الرسوميات الجذابة",
  },  
  {
    image: game2,
    fname: "تطوير البرمجيات",
    description:
      "نستخدم أحدث لغات البرمجة وأطر العمل لإنشاء ألعاب عالية الجودة، سواء كانت للأجهزة المحمولة أو الحواسيب أو منصات الألعاب",
  },  
  {
    image: game3,
    fname: " اختبار الألعاب",
    description:
      "نقوم بإجراء اختبارات شاملة لضمان خلو الألعاب من الأخطاء وتحقيق أداء ممتاز قبل الإطلاق ",
  },  
  {
    image: game4,
    fname: " الدعم والصيانة",
    description:
      " تطوير تطبيقات ومواقع إلكترونية باستخدام لغات برمجة ، مما يضمن تفاعل مع المحتوى بشكل ديناميكي وفعال",
  },  



];

export const Comuni = [
  {
    image: com1,
    fname: " إدارة متطورة للمكالمات",
    description:
      "يوفر لك السنترال الذكي واجهة سهلة الاستخدام لإدارة المكالمات، مما يعزز الكفاءة التشغيلية",
 
  },  
  {
    image: com2,
    fname: "توجيه المكالمات",
    description:
      "قم بتوجيه المكالمات إلى الأقسام المناسبة بسهولة، مع إمكانية تخصيص الإعدادات بحسب احتياجات عملك",
  },  
  {  image: com2,
    fname: "تحليل البيانات",
    description:
      "احصل على تقارير تفصيلية حول أنماط المكالمات، مما يساعدك على اتخاذ قرارات مستنيرة",
  },  




];
export const Comuni2 = [
  {
    image: com1,
    fname: " مكالمات صوتية عالية الجودة",
    description:
      "يتمتع نظام VoIP بجودة صوت ممتازة، مما يضمن لك تجربة اتصال متميزة",
 
  },  
  {
    image: com2,
    fname: "توفير التكاليف",
    description:
      "قلل من نفقات الاتصالات التقليدية بفضل الأسعار التنافسية التي نقدمها",
  },  
  {  image: com2,
    fname: "التكامل مع التطبيقات",
    description:
      "يمكنك دمج نظام VoIP مع تطبيقاتك المفضلة لتسهيل التواصل بين فريق العمل",
  },  




];


export const adv = [
  {
    image: user1,
    fname: "التسويق عبر محركات البحث",
    description:
      "قم بزيادة ظهور علامتك التجارية من خلال الاعلانات المدفوعة وتحليل الكلمات الافتتاحية لضمان وصول الاعلانات الى الجمهور المناسب",
  },  
  {
    image: user5,
    fname: "تحسين محركات البحث",
    description:
      "تحليل المواقع وعمل تقييم شامل للموقع لتحسين ترتيبك فى نتائج البحث وانشاء محتوي جذاب متوافق مع محركات البحث يجذب الزوار ويزيد من التفاعل",
  },  
  {
    image: user4,
    fname: "التسويق عبر وسائل التواصل الاجتماعي",
    description:
      "ادارة الحسابات المختلف على المنصات الاجتماعية مثل فيسبوك وانتسجرام وانشاء محتوي مخصص وتصميم محتوي يتناسب مع هوية علامتك التجارية وجذب المتابعين ",
  },  
  {
    image: user2,
    fname: "الإعلانات الممولة",
    description:
      " إنشاء وإدارة حملات إعلانية مدفوعة عبر الإنترنت لتحقيق أفضل النتائج وتحليل الاداء والبيانات لضمان تحقيق اهداف الحملة",
  },  
  {
    image: user6,
    fname: "التسويق بالمحتوى",
    description:
      "تطوير استراتيجيات محتوى مبتكرة تعزز من تفاعل الجمهور مع علامتك التجارية وتقديم محتوي غني وجذاب يعكس خبرتك فى مجالك",
  },  



];